PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1, 128u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2, 192u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, sh, 192u, 1u);
    CY_CRYPTO_VU_LSR(base, my_z, my_x, sh);      /* t11..t6 */

    CY_CRYPTO_VU_SET_REG(base, sh, 128u, 1u);
    CY_CRYPTO_VU_LSR(base, t1, my_z, sh);        /* t11..t10 */
    CY_CRYPTO_VU_SET_REG(base, sh, 64u, 1u);
    CY_CRYPTO_VU_LSL(base, t2, my_z, sh);        /* t9..t6 * 2^64 */


    CY_CRYPTO_VU_ADD(base, my_z, my_z, my_x);    /* t11..t6 + t5..t0 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);   /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);

    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);      /* t9..t6 * 2^64 + t11..t6 + t5..t0 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);   /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);

    CY_CRYPTO_VU_LSL(base, t2, t1, sh);          /* t11..t10 * 2^64 */
    CY_CRYPTO_VU_OR(base, t1, t1, t2);           /* t11..t10 * 2^64 + t11..t10 */

    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);      /* t11..t10 * 2^64 + t11..t10 + t9..t6 * 2^64 + t11..t6 + t5..t0 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);   /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t1) | CY_CRYPTO_VU_REG_BIT(t2));
    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_CS_MUL_Red_P224
****************************************************************************//**
*
* Curve-specific multiplication modular reduction for P224.
* 0 <= a, b < P224
* a6..a0 * b6..b0 % P224 = t13..t0 % P224
* P224 = 2^224 - 2^96 - 1
* t6..t0 + t10..t7*2^96 + t13..t11*2^96 - t13..t7 - t13..t11 % 2^224 - 2^96 - 1
* t13..t11*2^96 + t6..t0 - t13..t7 - t13..t11 + t10..t7*2^96 % 2^224 - 2^96 - 1
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [224 bits].
*
* \param x
* Product = a*b [2*224 bits].
*
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P224(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    uint32_t sh   = 0u;
    uint32_t t1   = 1u;     /* 224 */
    uint32_t t2   = 2u;     /* 224 */
    uint32_t t3   = 3u;     /* 224 */
    uint32_t my_z = 4u;
    uint32_t my_x = 5u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_z, z);
    CY_CRYPTO_VU_LD_REG(base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1, CY_CRYPTO_ECC_P224_SIZE);   /* 224 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2, CY_CRYPTO_ECC_P224_SIZE);   /* 224 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t3, CY_CRYPTO_ECC_P224_SIZE);   /* 224 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, sh, CY_CRYPTO_ECC_P224_SIZE, 1u);  /* sh   = 224 */
    CY_CRYPTO_VU_LSR(base, my_z, my_x, sh);  /* z = t13..t7 */

    CY_CRYPTO_VU_SET_REG(base, sh, 128u, 1u);
    CY_CRYPTO_VU_LSR(base, t1, my_z, sh);    /* t1 = t13..t11 */

    CY_CRYPTO_VU_SET_REG(base, sh, 96u, 1u);
    CY_CRYPTO_VU_LSL(base, t2, t1, sh);      /* t2 = t13..t11*2^96 */

    CY_CRYPTO_VU_SET_REG(base, sh, 96u, 1u);
    CY_CRYPTO_VU_LSL(base, t3, my_z, sh);    /* t3 = t10..t7*2^96 */

    CY_CRYPTO_VU_ADD(base, t2, t2, my_x);    /* t2 = t13..t11*2^96 + t6..t0 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, t2, VR_P);     /* C    = (t2 >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, t2, t2, VR_P);     /* t2 = t2 - p, if C==1 (Carry is set) */

    CY_CRYPTO_VU_SUB(base, t2, t2, my_z);    /* t2 = (t13..t11*2^96 + t6..t0) - t13..t7 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, t2, t2, VR_P);     /* t2 = t2 + p, if C==0 (Carry is clear) */

    CY_CRYPTO_VU_SUB(base, t2, t2, t1);      /* t2 = (t13..t11*2^96 + t6..t0 - t13..t7) - t13..t11 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, t2, t2, VR_P);     /* t2 = t2 + p, if C==0 (Carry is clear) */

    CY_CRYPTO_VU_ADD(base, my_z, t2, t3);    /* z = (t13..t11*2^96 + t6..t0 - t13..t7 - t13..t11) + t10..t7*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);   /* C    = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);     /* z = z - p, if C==1 (Carry is set) */

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t1) | CY_CRYPTO_VU_REG_BIT(t2) | CY_CRYPTO_VU_REG_BIT(t3));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_CS_MUL_Red_P256
****************************************************************************//**
*
* Curve-specific multiplication modular reduction for P256.
* 0 <= a, b < P256
* a7..a0 * b7..b0 % P256 = t15..t0 % P256
* P224 = 2^256 - 2^224 + 2^192 + 2^96 - 1
* t7..t0 + 2*t15..t11*2^96 + 2*t15..t12*2^96 + (t15..t14*2^192 + t10..t8)
* + (t8*2^224 + t13*2^192 + t15..t9) - (t10*2^224 + t8*2^192 + t13..t11)
* - (t11*2^224 + t9*2^192 + t15..t12) - (t12*2^224 + t10..t8*2^96 + t15..t13)
* - (t13*2^224 + t11..t9*2^96 + t15..t14) % 2^256 - 2^224 + 2^192 + 2^96 - 1
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [256 bits].
*
* \param x
* Product = a*b [2*256 bits].
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P256(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    uint32_t sh     = 0u;   /* Variable values */
    uint32_t sh32   = 1u;
    uint32_t sh96   = 2u;
    uint32_t sh192  = 3u;
    uint32_t sh224  = 4u;
    uint32_t t0     = 5u;   /* 256 */
    uint32_t t1     = 6u;   /* 256 */
    uint32_t t2     = 7u;   /* 256 */
    uint32_t t3     = 8u;   /* 32 */
    uint32_t t4     = 9u;   /* 96 */
    uint32_t my_z   = 10u;
    uint32_t my_x   = 11u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_z, z);
    CY_CRYPTO_VU_LD_REG(base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t0, CY_CRYPTO_ECC_P256_SIZE);  /* 256 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

