PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1, CY_CRYPTO_ECC_P256_SIZE);  /* 256 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2, CY_CRYPTO_ECC_P256_SIZE);  /* 256 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t3, 32u);       /* 32 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t4, 96u);       /* 96 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, sh, CY_CRYPTO_ECC_P256_SIZE, 1u);     /* sh = 256 */
    CY_CRYPTO_VU_SET_REG(base, sh32, 32u, 1u);    /* sh = 32 */
    CY_CRYPTO_VU_SET_REG(base, sh96, 96u, 1u);    /* sh = 96 */
    CY_CRYPTO_VU_SET_REG(base, sh192, 192u, 1u);  /* sh = 192 */
    CY_CRYPTO_VU_SET_REG(base, sh224, 224u, 1u);  /* sh = 224 */

    CY_CRYPTO_VU_LSR(base, t0, my_x, sh);       /* t0 = t15..t8 */
    CY_CRYPTO_VU_LSR(base, my_z, t0, sh96);     /* z = t15..t11 */
    CY_CRYPTO_VU_LSR(base, t1, my_z, sh32);     /* t1 = t15..t12 */
    CY_CRYPTO_VU_LSR(base, t3, my_z, sh32);     /* t3 = t12 */

    /* 2*S1 -- 2*t15..t11*2^96 */
    CY_CRYPTO_VU_LSL(base, my_z, my_z, sh96);   /* z = t15..t11*2^96 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, my_z);   /* z = 2*t15..t11*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D3 (a) -- t12*2^224 */
    CY_CRYPTO_VU_LSL(base, t2, t3, sh224);      /* t2 = t12*2^224 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t12*2^224 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* 2*S2 -- 2*t15..t12*2^96 */
    CY_CRYPTO_VU_LSL(base, t2, t1, sh96);       /* t2 = t15..t12*2^96 */

    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t15..t12*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + 2*t15..t12*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D4 (c) -- t15..t14 */
    CY_CRYPTO_VU_LSR(base, t2, t0, sh192);      /* t2 = t15..t14 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t15..t14 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S3 (a) -- t15..t14*2^192 */
    CY_CRYPTO_VU_LSL(base, t2, t2, sh192);      /* t2 = t15..t14*2^192 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t15..t14*2^192 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D2 (c) -- t15..t12 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t1);     /* z = z - t15..t12 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S4 (b) -- t13*2^192 */
    CY_CRYPTO_VU_LSR(base, t3, t1, sh32);       /* t3 = t13 */
    CY_CRYPTO_VU_LSL(base, t2, t3, sh192);      /* t2 = t13*2^192 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t13*2^192 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D4 (a) -- t13*2^224 */
    CY_CRYPTO_VU_LSL(base, t2, t2, sh32);       /* t2 = t13*2^224 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t13*2^224 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* D3 (c) -- t15..t13 */
    CY_CRYPTO_VU_LSR(base, t1, t1, sh32);       /* t1 = t15..t13 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t1);     /* z = z - t15..t13 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S4 (c) -- t15..t13*2^96 */
    CY_CRYPTO_VU_LSL(base, t2, t1, sh96);       /* t2 = t15..t13*2^96 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t15..t13*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D2 (a) -- t11*2^224 */
    CY_CRYPTO_VU_LSR(base, t3, t0, sh96);       /* t3 = t11 */
    CY_CRYPTO_VU_LSL(base, t2, t3, sh224);      /* t2 = t11*2^224 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t11*2^224 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* D2 (b) -- t9*2^192 */
    CY_CRYPTO_VU_LSR(base, t3, t0, sh32);       /* t3 = t9 */
    CY_CRYPTO_VU_LSL(base, t2, t3, sh192);      /* t2 = t9*2^192 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t9*2^192 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* D1 (c) -- t13..t11 */
    CY_CRYPTO_VU_LSR(base, t4, t0, sh96);       /* t4 = t13..t11 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t4);     /* z = z - t13..t11 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S4 (d) -- t11..t9 */
    CY_CRYPTO_VU_LSR(base, t4, t0, sh32);       /* t4 = t11..t9 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t4);     /* z = z + t11..t9 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

