PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    /* D1 (a) -- t10*2^224 */
    CY_CRYPTO_VU_LSR(base, t3, t4, sh32);       /* t3 = t10 */
    CY_CRYPTO_VU_LSL(base, t2, t3, sh224);      /* t2 = t10*2^224 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t10*2^224 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */


    /* D4 (b) -- t11..t9*2^96 */
    CY_CRYPTO_VU_LSL(base, t2, t4, sh96);       /* t2 = t11..t9*2^96 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t11..t9*2^96 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    CY_CRYPTO_VU_SET_REG(base, sh, 0u, 1u);       /* sh = 0; */

    /* S3 (b) -- t10..t8 */
    CY_CRYPTO_VU_LSR(base, t4, t0, sh);         /* t4 = t10..t8 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t4);     /* z = z + t10..t8 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D3 (b) -- t10..t8*2^96 */
    CY_CRYPTO_VU_LSL(base, t2, t4, sh96);       /* t4 = t10..t8*2^96 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t10..t8*2^96 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S4 (a) -- t8*2^224 */
    CY_CRYPTO_VU_LSL(base, t2, t0, sh224);      /* t2 = t8*2^224 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t8*2^224 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D1 (b) -- t8*2^192 */
    CY_CRYPTO_VU_LSR(base, t2, t2, sh32);       /* t2 = t8*2^192 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t8*2^192 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* T -- t7..t0 */
    CY_CRYPTO_VU_LSR(base, t2, my_x, sh);       /* t2 = t8*2^192 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t7..t0 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t0) | CY_CRYPTO_VU_REG_BIT(t1) |
                          CY_CRYPTO_VU_REG_BIT(t2) | CY_CRYPTO_VU_REG_BIT(t3) | CY_CRYPTO_VU_REG_BIT(t4));
    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_CS_MUL_Red_P384
****************************************************************************//**
*
* Curve-specific multiplication modular reduction for P384.
* 0 <= a, b < P384
* a11..a0 * b11..b0 % P384 = t23..t0 % P384
* P384 = 2^384 - 2^128 - 2*96 + 2*32 - 1
* t11..t0 + 2*t23..t21*2^128 + t23..t12 + (t20..t12*2^96 + t23..t21)
* + (t19..t12*2^128 + t20*2^96 +t23*2^32) + t23..t20*2^128 + (t23..t21*2^96 + t20)
* - (t22..t12*2^32 + t23) - t23..t20*2^32 - (t23*2^128 + t23*2^96) % P384
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [384 bits]
*
* \param x
* Product = a*b [2*384 bits]
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P384(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    uint32_t sh32   = 0u;
    uint32_t sh64   = 1u;
    uint32_t sh96   = 2u;
    uint32_t sh128  = 3u;
    uint32_t sh256  = 4u;
    uint32_t sh384  = 5u;
    uint32_t t0     = 6u;   /* 384 */
    uint32_t t1     = 7u;   /* 384 */
    uint32_t t2     = 8u;   /*  32 */
    uint32_t my_z   = 9u;
    uint32_t my_x   = 10u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_z, z);
    CY_CRYPTO_VU_LD_REG(base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t0, CY_CRYPTO_ECC_P384_SIZE);  /* 384 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1, CY_CRYPTO_ECC_P384_SIZE);  /* 384 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2, 32u);   /* 32 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, sh32, 32u, 1u);    /* sh32  = 32 */
    CY_CRYPTO_VU_SET_REG(base, sh64, 64u, 1u);    /* sh64  = 64 */
    CY_CRYPTO_VU_SET_REG(base, sh96, 96u, 1u);    /* sh96  = 96 */
    CY_CRYPTO_VU_SET_REG(base, sh128, 128u, 1u);  /* sh128 = 128 */
    CY_CRYPTO_VU_SET_REG(base, sh256, 256u, 1u);  /* sh256 = 256 */
    CY_CRYPTO_VU_SET_REG(base, sh384, CY_CRYPTO_ECC_P384_SIZE, 1u);          /* sh384 = 384 */

    CY_CRYPTO_VU_LSR(base, t0, my_x, sh384);    /* t0 = t23..t12 */

    /* T + S2 -- t11..t0 + t23..t12 */
    CY_CRYPTO_VU_ADD(base, my_z, t0, my_x);     /* z = t23..t12 + t11..t0 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* S6 (b) -- t_20 */
    CY_CRYPTO_VU_LSR(base, t2, t0, sh256);      /* t2 = t20 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t2);     /* z = z + t20 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* S4 (b) -- t20*2^96 */
    CY_CRYPTO_VU_LSL(base, t1, t2, sh96);       /* t1 = t20*2^96 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t20*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* S5 -- t23..t20*2^128 */
    CY_CRYPTO_VU_LSR(base, t1, t0, sh256);      /* t1 = t23..t20 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh128);      /* t1 = t23..t20*2^128 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t23..t20*2^128 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D2 -- t23..t20*2^32 */
    CY_CRYPTO_VU_LSR(base, t1, t1, sh96);       /* t1 = t23..t20*2^32 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t1);     /* z = z - t23..t20*2^32 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S3 (b) -- t23..t21 */
    CY_CRYPTO_VU_LSR(base, t1, t1, sh64);       /* t1 = t23..t21 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t23..t21 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D1 (b) -- t23 */
    CY_CRYPTO_VU_LSR(base, t2, t1, sh64);       /* t2 = t23 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t2);     /* z = z - t23 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S6 (a) -- t23..t21*2^96 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh96);       /* t1 = t23..t21*2^96 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t23..t21*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* 2*S1 -- 2*t23..t21*2^128 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh32);       /* t1 = t23..t21*2^128 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t23..t21*2^128 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t20..t12*2^128 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* S4 (c) -- t23*2^32 */
    CY_CRYPTO_VU_LSL(base, t1, t2, sh32);       /* t1 = t23*2^32 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t23*2^32 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* D3 (b) -- t23*2^96 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh64);       /* t1 = t23*2^96 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t1);     /* z = z - t23*2^96 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* D3 (a) -- t23*2^128 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh32);       /* t1 = t23*2^128 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t1);     /* z = z - t23*2^128 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* D1 (a) -- t22..t12*2^32 */
    CY_CRYPTO_VU_LSL(base, t1, t0, sh32);       /* t1 = t22..t12*2^32 */
    CY_CRYPTO_VU_SUB(base, my_z, my_z, t1);     /* z = z - t22..t12*2^32 */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, my_z, my_z, VR_P);    /* z = z + p, if C==0 (Carry is clear) */

    /* S3 (a) -- t20..t12*2^96 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh64);       /* t1 = t20..t12*2^96 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t20..t12*2^96 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    /* S4 (a) -- t19..t12*2^128 */
    CY_CRYPTO_VU_LSL(base, t1, t1, sh32);       /* t1 = t19..t12*2^128 */
    CY_CRYPTO_VU_ADD(base, my_z, my_z, t1);     /* z = z + t19..t12*2^128 */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (z >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* z = z - p, if C==1 (Carry is set) */

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t0) | CY_CRYPTO_VU_REG_BIT(t1) | CY_CRYPTO_VU_REG_BIT(t2));
    CY_CRYPTO_VU_POP_REG(base);

