PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED) */


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_CS_MUL_Red_P521
****************************************************************************//**
*
* Curve-specific multiplication modular reduction for P521.
* 0 <= a, b < P521
* P521 = 2^521 - 1
* a*b = T = T1*2^521 + T0
* T1 = t1041..t521
* T0 = t520..t0
* T mod p521 = T0 + T1 mod P521
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [521 bits]
*
* \param x
* Product = a*b [2*521 bits]
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MUL_Red_P521(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    uint32_t sh521   = 0u;
    uint32_t t0      = 1u;
    uint32_t my_z    = 2u;
    uint32_t my_x    = 3u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_z, z);
    CY_CRYPTO_VU_LD_REG(base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t0, CY_CRYPTO_ECC_P521_SIZE);  /* 521 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_SET_REG(base, sh521, 521u, 1u);                  /* sh521  = 521 */

    CY_CRYPTO_VU_LSR(base, my_z, my_x, sh521);                  /* z = T1 */

    CY_CRYPTO_VU_ADD(base, my_z, my_z, my_x);                   /* z = T1 + T0 */

    /* T0 + T1 mod p */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, my_z, VR_P);      /* C = (t2 >= VR_P) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, my_z, my_z, VR_P);    /* t2 = t2 - p, if C==1 (Carry is set) */

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t0));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED) */


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_CS_MulRed
****************************************************************************//**
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result.
*
* \param x
* Product.
*
* \param size
* Size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_CS_MulRed(CRYPTO_Type *base, uint32_t z, uint32_t x, uint32_t size)
{
    (void)size; /* Suppress warning */
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    switch (eccMode)
    {
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED)
    case CY_CRYPTO_ECC_ECP_SECP192R1:
        tmpResult = Cy_Crypto_Core_EC_CS_MUL_Red_P192(base, z, x);
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED)
    case CY_CRYPTO_ECC_ECP_SECP224R1:
        tmpResult = Cy_Crypto_Core_EC_CS_MUL_Red_P224(base, z, x);
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED)
    case CY_CRYPTO_ECC_ECP_SECP256R1:
        tmpResult = Cy_Crypto_Core_EC_CS_MUL_Red_P256(base, z, x);
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED)
    case CY_CRYPTO_ECC_ECP_SECP384R1:
        tmpResult = Cy_Crypto_Core_EC_CS_MUL_Red_P384(base, z, x);
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED)
    case CY_CRYPTO_ECC_ECP_SECP521R1:
        tmpResult = Cy_Crypto_Core_EC_CS_MUL_Red_P521(base, z, x);
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED) */
    default:
        /* Unsupported Eliptic Curve ID */
        break;
    }

    return tmpResult;
}


/**********************************************************************
*  Shift-multiply, curve-specific multiplication reduction algorithms
**********************************************************************/


#if defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_SM_MUL_Red_P192
****************************************************************************//**
*
* Shift-multiply multiplication modular reduction for P192.
* a[CURVE_SIZE-1:0] * b[CURVE_SIZE-1:0] mod p[CURVE_SIZE-1:0]
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [192 bits].
*
* \param x
* Product = a*b [2*192 bits].
*
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_SM_MUL_Red_P192(CRYPTO_Type *base, uint32_t z, uint32_t x)
{
    /* Setup */
    uint32_t partial  = 0u;
    uint32_t hi       = 1u;
    uint32_t sh64     = 2u;
    uint32_t sh192    = 3u;
    uint32_t my_z     = 4u;
    uint32_t my_x     = 5u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_z, z);
    CY_CRYPTO_VU_LD_REG(base, my_x, x);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, partial, CY_CRYPTO_ECC_P192_SIZE + 65u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, hi, CY_CRYPTO_ECC_P192_SIZE + 64u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_SET_REG(base, sh64, 64u, 1u);
    CY_CRYPTO_VU_SET_REG(base, sh192, 192u, 1u);

    /* Step 2: 1st round of shift-multiply
     * (Separate hi and lo (LSR hi>>CURVE_SIZE), multiply hi (LSL hi and add 1) and add shifted hi to lo)
     * hi * (2^{64} + 1) + lo
     */
    CY_CRYPTO_VU_LSR(base, hi, my_x, sh192);     /* hi = prod >> CURVE_SIZE = prod[383:192] */
    CY_CRYPTO_VU_MOV(base, my_z, my_x);          /* z == lo = prod[191:0] */

    CY_CRYPTO_VU_ADD(base, partial, hi, my_z);   /* partial = (hi*1) + lo */

