PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2_plus2, size + 2u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_SUB(base, t2_plus2, z_double, t_double);

    CY_CRYPTO_VU_SUB(base, t1_plus2, t2_plus2, VR_P);
    CY_CRYPTO_VU_COND_SWAP_REG(base, CY_CRYPTO_VU_COND_CC, t1_plus2, t2_plus2);

    CY_CRYPTO_VU_SUB(base, t2_plus2, t1_plus2, VR_P);
    CY_CRYPTO_VU_COND_MOV(base, CY_CRYPTO_VU_COND_CC, my_z, t1_plus2);
    CY_CRYPTO_VU_COND_MOV(base, CY_CRYPTO_VU_COND_CS, my_z, t2_plus2);

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t2_plus2) |
                          CY_CRYPTO_VU_REG_BIT(t1_plus2) |
                          CY_CRYPTO_VU_REG_BIT(t_double));
    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}


/***************************************************************
*       Multiplication reduction algorithm select
***************************************************************/


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_MulRed
****************************************************************************//**
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = x mod P = a*b mod P [224 bits].
*
* \param x
* Product = a*b [2*224 bits].
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_EC_MulRed(CRYPTO_Type *base, uint32_t z, uint32_t x, uint32_t size)
{
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    switch (mul_red_alg_select)
    {
    case CY_CRYPTO_NIST_P_CURVE_SPECIFIC_RED_ALG:
        /* Curve-specific multiplication reduction algorithms */
        tmpResult = Cy_Crypto_Core_EC_CS_MulRed(base, z, x, size);
        break;
    case CY_CRYPTO_NIST_P_SHIFT_MUL_RED_ALG:
        /* Shift-multiply, curve-specific multiplication reduction algorithms */
        tmpResult = Cy_Crypto_Core_EC_SM_MulRed(base, z, x, size);
        break;
    default:
        /* Generic Barrett modular reduction */
        tmpResult = Cy_Crypto_Core_EC_Bar_MulRed(base, z, x, size);
        break;
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_MulMod
****************************************************************************//**
*
* Modular multiplication in GF(VR_P).
* Leaf function.
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a * b % mod. Register index for product value.
*
* \param a
* Register index for multiplicand value.
*
* \param b
* Register index for multiplier value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_EC_MulMod(CRYPTO_Type *base,
        uint32_t z,
        uint32_t a,
        uint32_t b,
        uint32_t size)
{
    uint32_t ab_double       = 0u;
    uint32_t my_z            = 1u;
    uint32_t my_a            = 2u;
    uint32_t my_b            = 3u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_z, z);
    CY_CRYPTO_VU_LD_REG(base, my_a, a);
    CY_CRYPTO_VU_LD_REG(base, my_b, b);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, ab_double, 2u * size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_UMUL(base, ab_double, my_a, my_b);
    Cy_Crypto_Core_Vu_WaitForComplete(base);

    /* Modular Reduction: Barrett reduction or curve-specific or shift-multiply */
    tmpResult = Cy_Crypto_Core_EC_MulRed(base, my_z, ab_double, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(ab_double));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_AddMod
****************************************************************************//**
*
* Modular addition in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a + b % mod. Register index for sum value
*
* \param a
* Register index for augend a value.
*
* \param b
* Register index for addend b value.
*
*******************************************************************************/
void Cy_Crypto_Core_EC_AddMod(CRYPTO_Type *base, uint32_t z, uint32_t a, uint32_t b)
{
    CY_CRYPTO_VU_ADD(base, z, a, b);                                 /* C = (sum >= 2^n) */
    CY_CRYPTO_VU_COND_CMP_SUB(base, CY_CRYPTO_VU_COND_CC, z, VR_P);  /* C = (sum >= mod) */
    CY_CRYPTO_VU_COND_SUB(base, CY_CRYPTO_VU_COND_CS, z, z, VR_P);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_SubMod
****************************************************************************//**
*
* Modular subtraction in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a - b % mod. Register index for difference value.
*
* \param a
* Register index for minuend a value.
*
* \param b
* RRegister index for subtrahend b value.
*
*******************************************************************************/
void Cy_Crypto_Core_EC_SubMod(CRYPTO_Type *base, uint32_t z, uint32_t a, uint32_t b)
{
    CY_CRYPTO_VU_SUB(base, z, a, b);        /* C = (a >= b) */
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_CC, z, z, VR_P);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_HalfMod
****************************************************************************//**
*
* Modular halving in GF(VR_P).
* Leaf function.
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a / 2 % mod. Register index for result value.
*
* \param a
* Register index for value to be halved.
*
*******************************************************************************/
void Cy_Crypto_Core_EC_HalfMod(CRYPTO_Type *base, uint32_t z, uint32_t a)
{
    CY_CRYPTO_VU_TST(base, a);
    CY_CRYPTO_VU_COND_ADD(base, CY_CRYPTO_VU_COND_ODD, a, a, VR_P);
    CY_CRYPTO_VU_LSR1_WITH_CARRY(base, z, a);
}


