PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_SquareMod
****************************************************************************//**
*
* Modular squaring in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a * a % mod. Register index for product value.
*
* \param a
* Register index for multiplicand and multiplier value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_EC_SquareMod(CRYPTO_Type *base,
        uint32_t z,
        uint32_t a,
        uint32_t size)
{
    return Cy_Crypto_Core_EC_MulMod(base, z, a, a, size);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_DivMod
****************************************************************************//**
*
* Modular division in GF(VR_P).
* This algorithm works when "dividend" and "divisor" are relatively prime,
* Reference: "From Euclid's GCD to Montgomery Multiplication to the Great Divide",
* S.C. Schantz
*
* \param base
* The pointer to a Crypto instance.
*
* \param z
* Result = a / b % mod. Register index for quotient value.
*
* \param a
* Register index for dividend value.
*
* \param b
* Register index for divisor value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_EC_DivMod(CRYPTO_Type *base,
        uint32_t z,
        uint32_t a,
        uint32_t b,
        uint32_t size)
{
    uint32_t my_dividend = 7u;
    uint32_t my_divisor  = 8u;
    uint32_t my_a        = 9u;
    uint32_t my_b        = 10u;
    uint32_t my_u        = 11u;
    uint32_t my_v        = 12u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    uint32_t zero;
    uint32_t carry;
    uint32_t a_even;
    uint32_t b_even;

    uint32_t status0;
    uint32_t status1;
    uint32_t status2;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_dividend, a);
    CY_CRYPTO_VU_LD_REG(base, my_divisor, b);
    CY_CRYPTO_VU_LD_REG(base, my_u, z);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_a, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_b, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_v, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_MOV(base, my_a, my_divisor);
    CY_CRYPTO_VU_MOV(base, my_b, VR_P);
    CY_CRYPTO_VU_MOV(base, my_u, my_dividend);

    CY_CRYPTO_VU_SET_TO_ZERO(base, my_v);

    while (true)
    {
        CY_CRYPTO_VU_CMP_SUB(base, my_a, my_b);
        status0 = Cy_Crypto_Core_Vu_StatusRead(base);

        CY_CRYPTO_VU_TST(base, my_a);
        status1 = Cy_Crypto_Core_Vu_StatusRead(base);

        CY_CRYPTO_VU_TST(base, my_b);
        status2 = Cy_Crypto_Core_Vu_StatusRead(base);

        zero    = status0 & CY_CRYPTO_VU_STATUS_ZERO_BIT;  /* a == b */
        carry   = status0 & CY_CRYPTO_VU_STATUS_CARRY_BIT; /* a >= b */
        a_even  = status1 & CY_CRYPTO_VU_STATUS_EVEN_BIT;
        b_even  = status2 & CY_CRYPTO_VU_STATUS_EVEN_BIT;

        if (0u != zero)
        {
            break;
        }

        if (0u != a_even)
        {
            CY_CRYPTO_VU_LSR1(base, my_a, my_a);
            Cy_Crypto_Core_EC_HalfMod(base, my_u, my_u);
        }
        else if (0u != b_even)
        {
            CY_CRYPTO_VU_LSR1(base, my_b, my_b);
            Cy_Crypto_Core_EC_HalfMod(base, my_v, my_v);
        }
        else if (0u != carry)
        {
            /* (a >= b) */
            CY_CRYPTO_VU_SUB(base, my_a, my_a, my_b);
            CY_CRYPTO_VU_LSR1(base, my_a, my_a);

            Cy_Crypto_Core_EC_SubMod(base, my_u, my_u, my_v);
            Cy_Crypto_Core_EC_HalfMod(base, my_u, my_u);
        }
        else
        {
            CY_CRYPTO_VU_SUB(base, my_b, my_b, my_a);
            CY_CRYPTO_VU_LSR1(base, my_b, my_b);

            Cy_Crypto_Core_EC_SubMod(base, my_v, my_v, my_u);
            Cy_Crypto_Core_EC_HalfMod(base, my_v, my_v);
        }
    }

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(my_a) | CY_CRYPTO_VU_REG_BIT(my_b) | CY_CRYPTO_VU_REG_BIT(my_v));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_JacobianTransform
****************************************************************************//**
*
* Transformation from affine coordinates to Jacobian projective coordinates in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for affine X coordinate and Jacobian projective X coordinate.
*
* \param s_y
* Register index for affine Y coordinate and Jacobian projective Y coordinate.
*
* \param s_z
* Register index for Jacobian projective Z coordinate.
*
*******************************************************************************/
void Cy_Crypto_Core_JacobianTransform(CRYPTO_Type *base, uint32_t s_x, uint32_t s_y, uint32_t s_z)
{
    (void)s_x; /* Suppress warning */
    (void)s_y; /* Suppress warning */
    CY_CRYPTO_VU_SET_TO_ONE(base, s_z);
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_JacobianInvTransform
****************************************************************************//**
*
* Transformation from Jacobian projective coordinates to affine coordinates in GF(VR_P).
* (s_x, s_y, s_z) -> (p_x, p_y), where p_x = s_x/s_z^2, p_y = s_y/s_z^3
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for affine X coordinate and Jacobian projective X coordinate.
*
* \param s_y
* Register index for affine Y coordinate and Jacobian projective Y coordinate.
*
* \param s_z
* Register index for Jacobian projective Z coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_JacobianInvTransform(CRYPTO_Type *base, uint32_t s_x, uint32_t s_y, uint32_t s_z, uint32_t size)
{

    uint32_t t1     = 7u;
    uint32_t t2     = 8u;
    uint32_t t3     = 9u;
    uint32_t my_s_x = 10u;
    uint32_t my_s_y = 11u;
    uint32_t my_s_z = 12u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_s_x, s_x);
    CY_CRYPTO_VU_LD_REG(base, my_s_y, s_y);
    CY_CRYPTO_VU_LD_REG(base, my_s_z, s_z);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t3, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

