PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    CY_CRYPTO_VU_SET_TO_ONE(base, t1);                      /* t1 = 1 */

    tmpResult = Cy_Crypto_Core_EC_DivMod(base, t2, t1, my_s_z, size);   /* t2 = 1/Z */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t1, t2, size);        /* t1 = 1/Z^2 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, my_s_x, my_s_x, t1, size);   /* my_s_x = X/Z^2 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t3, my_s_y, t1, size);   /* t3 = Y/Z^2 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, my_s_y, t3, t2, size);   /* my_s_y = Y/Z^3 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t1) | CY_CRYPTO_VU_REG_BIT(t2) | CY_CRYPTO_VU_REG_BIT(t3));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_JacobianEcAdd
****************************************************************************//**
*
* Elliptic curve point addition on mixed Jacobian projective (s) / affine (t) coordinates in GF(VR_P).
* Reference: "fast and regular algorithms for scalar multiplication over elliptic curves", M. Rivain.
* Upper case register variables refer to Jacobian projective coordinate values.
* Lower case register variables refer to affine coordinate values.
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for Jacobian projective X coordinate.
*
* \param s_y
* Register index for Jacobian projective Y coordinate.
*
* \param s_z
* Register index for Jacobian projective Z coordinate.
*
* \param t_x
* Register index for affine X coordinate.
*
* \param t_y
* Register index for affine Y coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_JacobianEcAdd(CRYPTO_Type *base,
        uint32_t s_x,
        uint32_t s_y,
        uint32_t s_z,
        uint32_t t_x,
        uint32_t t_y,
        uint32_t size
                                                  )
{

    uint32_t t6     = 4u;
    uint32_t t7     = 5u;
    uint32_t t8     = 6u;
    uint32_t t9     = 7u;
    uint32_t my_s_x = 8u;
    uint32_t my_s_y = 9u;
    uint32_t my_s_z = 10u;
    uint32_t my_t_x = 11u;
    uint32_t my_t_y = 12u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_s_x, s_x);
    CY_CRYPTO_VU_LD_REG(base, my_s_y, s_y);
    CY_CRYPTO_VU_LD_REG(base, my_s_z, s_z);
    CY_CRYPTO_VU_LD_REG(base, my_t_x, t_x);
    CY_CRYPTO_VU_LD_REG(base, my_t_y, t_y);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t6, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t7, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t8, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t9, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t6, my_s_z, size);        /* t6 = ZZ */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t8, my_t_x, t6, size);      /* t8 = xZZ = B */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t7, my_t_y, my_s_z, size);   /* t7 = yZ */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_EC_SubMod(base, my_s_x, my_s_x, t8);         /* my_s_x = X - B = E */

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, my_s_z, my_s_x, my_s_z, size);   /* my_s_z = E*Z = Z3 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t9, t7, t6, size);           /* t9 = yZZZ = D */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_EC_SubMod(base, my_s_y, my_s_y, t9);         /* my_s_y = Y - D = F */
    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t6, my_s_x, size);        /* t6 = EE */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t7, t8, t6, size);           /* t7 = B*EE */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t8, t6, my_s_x, size);       /* t8 = EEE */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t6, t9, t8, size);           /* t6 = D*EEE */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, my_s_x, my_s_y, size);    /* my_s_x = FF */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_EC_SubMod(base, my_s_x, my_s_x, t8);         /* my_s_x = FF - EEE */
    Cy_Crypto_Core_EC_AddMod(base, t9, t7, t7);                 /* t9 = 2*B*EE */
    Cy_Crypto_Core_EC_SubMod(base, my_s_x, my_s_x, t9);         /* my_s_x = FF - EEE - 2*B*EE = X3 */
    Cy_Crypto_Core_EC_SubMod(base, t7, t7, my_s_x);             /* t7 = B*EE - X3 */
    tmpResult = Cy_Crypto_Core_EC_MulMod(base, my_s_y, my_s_y, t7, size);   /* my_s_y = F*(B*EE - X3) */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

