PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    Cy_Crypto_Core_EC_SubMod(base, my_s_y, my_s_y, t6);         /* my_s_y = F*(3*B*EE - FF + EEE) - D*EEE = Y3 */

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t6) | CY_CRYPTO_VU_REG_BIT(t7) |
                          CY_CRYPTO_VU_REG_BIT(t8) | CY_CRYPTO_VU_REG_BIT(t9));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_JacobianEcDouble
****************************************************************************//**
*
* Elliptic curve point doubling on Jacobian projective coordinates in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for Jacobian projective X coordinate.
*
* \param s_y
* Register index for Jacobian projective Y coordinate.
*
* \param s_z
* Register index for Jacobian projective Z coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_JacobianEcDouble(CRYPTO_Type *base,
        uint32_t s_x,
        uint32_t s_y,
        uint32_t s_z,
        uint32_t size
                                                     )
/* 4M + 4S + 10A */
{
    uint32_t t1     = 1u;
    uint32_t t2     = 2u;
    uint32_t t3     = 3u;
    uint32_t t4     = 4u;
    uint32_t my_s_x = 5u;
    uint32_t my_s_y = 6u;
    uint32_t my_s_z = 7u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_s_x, s_x);
    CY_CRYPTO_VU_LD_REG(base, my_s_y, s_y);
    CY_CRYPTO_VU_LD_REG(base, my_s_z, s_z);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t3, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t4, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t4, my_s_y, size);        /* t4 = Y^2 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t3, my_s_z, size);        /* t3 = Z^2 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, my_s_z, my_s_y, my_s_z, size);   /* my_s_z = Y*Z */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, my_s_y, my_s_x, t4, size);   /* my_s_y = X*Y^2 = A */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    Cy_Crypto_Core_EC_AddMod(base, my_s_x, my_s_x, t3);         /* my_s_x = X + Z^2 */
    Cy_Crypto_Core_EC_AddMod(base, t3, t3, t3);                 /* t3 = 2*Z^2 */
    Cy_Crypto_Core_EC_SubMod(base, t3, my_s_x, t3);             /* t3 = (X + Z^2) - 2*Z^2 = X - Z^2 */

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t1, my_s_x, t3, size);       /* t1 = (X + Z^2) * (X - Z^2) = X^2 - Z^4 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_EC_AddMod(base, t3, t1, t1);                 /* t3 = 2*(X^2 - Z^4) */
    Cy_Crypto_Core_EC_AddMod(base, t1, t1, t3);                 /* t1 = 3*(X^2 - Z^4) */
    Cy_Crypto_Core_EC_HalfMod(base, t1, t1);                    /* t1 = 3/2*(X^2 - Z^4) = B */
    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t3, t1, size);            /* t3 = 9/4*(X^2 - Z^4) = B^2 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_EC_SubMod(base, t3, t3, my_s_y);             /* t3 = B^2 - A */
    Cy_Crypto_Core_EC_SubMod(base, my_s_x, t3, my_s_y);         /* my_s_x =  B^2 - 2*A */
    Cy_Crypto_Core_EC_SubMod(base, my_s_y, my_s_y, my_s_x);     /* my_s_y = A - (B^2 - 2*A) = 3*A - B^2 */

    tmpResult = Cy_Crypto_Core_EC_MulMod(base, t2, t1, my_s_y, size);       /* t2 = B*(3*A - B^2) */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Crypto_Core_EC_SquareMod(base, t1, t4, size);            /* t1 = Y^4 */
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Crypto_Core_EC_SubMod(base, my_s_y, t2, t1);             /* my_s_y = B*(3*A - B^2) - Y^4 */

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t1) | CY_CRYPTO_VU_REG_BIT(t2) |
                          CY_CRYPTO_VU_REG_BIT(t3) | CY_CRYPTO_VU_REG_BIT(t4));
    CY_CRYPTO_VU_POP_REG(base);


    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_JacobianEcScalarMul
****************************************************************************//**
*
* Elliptic curve point multiplication on Jacobian projective coordinates in GF(VR_P).
*
* \param base
* The pointer to a Crypto instance.
*
* \param s_x
* Register index for affine X coordinate.
*
* \param s_y
* Register index for affine Y coordinate.
*
* \param d
* Register index for multiplication/exponentiation value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_JacobianEcScalarMul(CRYPTO_Type *base, uint32_t s_x, uint32_t s_y, uint32_t d, uint32_t size)
{
    int32_t i;
    uint32_t status;
    uint32_t carry;
    uint16_t clsame;

    uint32_t clr     = 5u;
    uint32_t t       = 6u;
    uint32_t my_s_x  = 7u;
    uint32_t my_s_y  = 8u;
    uint32_t my_s_z  = 9u;
    uint32_t my_t_x  = 10u;
    uint32_t my_t_y  = 11u;
    uint32_t my_d    = 12u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, my_s_x, s_x);
    CY_CRYPTO_VU_LD_REG(base, my_s_y, s_y);
    CY_CRYPTO_VU_LD_REG(base, my_d, d);

