PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, clr, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_s_z, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_t_x, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, my_t_y, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* my_t_x has the same initial value of my_s_x, but does not point to the
    * same address in memory as my_s_x, i.e. different value after point doubling
    * my_t_x and my_t_y do not change from (original Jacobian projective coordinates of)
    * original base point
    */
    CY_CRYPTO_VU_MOV(base, my_t_x, my_s_x);
    CY_CRYPTO_VU_MOV(base, my_t_y, my_s_y);

    /* Affine-to-Jacobian Transform. */
    CY_CRYPTO_VU_SET_TO_ONE(base, my_s_z);

    /* EC scalar multiplication (irregular) operation. */
    CY_CRYPTO_VU_SET_TO_ZERO(base, clr);
    CY_CRYPTO_VU_CLSAME(base, t, my_d, clr);

    /* This is needed, otherwise clsame is wrong */
    Cy_Crypto_Core_Vu_WaitForComplete(base);

    clsame = Cy_Crypto_Core_Vu_RegDataPtrRead(base, t);

    CY_CRYPTO_VU_LSL(base, my_d, my_d, t);   /* Get rid of leading '0's */
    CY_CRYPTO_VU_LSL1(base, my_d, my_d);     /* Get rid of leading '1' */

    /* Binary left-to-right algorithm
    * Perform point addition and point doubling to implement scalar multiplication
    * Scan the bits of the scalar from left to right; perform point doubling for each bit,
    * and perform point addition when the bit is set.
    * Carry set if current bit is equal to 1 (hence, perform point addition - point
    * doubling is always performed)
    */
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8', 'Intentional typecast to int32_t because result of composite expression can be negative');
    for (i = 0; i < ((int32_t)(size - clsame - 1u)); i++)
    {
        /* Carry set if current bit is equal to 1 (hence, perform point addition - point
        * doubling is always performed)
        */
        CY_CRYPTO_VU_LSL1(base, my_d, my_d);
        status = Cy_Crypto_Core_Vu_StatusRead(base);

        carry = status & CY_CRYPTO_VU_STATUS_CARRY_BIT;

        tmpResult = Cy_Crypto_Core_JacobianEcDouble(base, my_s_x, my_s_y, my_s_z, size);

        if (CY_CRYPTO_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (carry != 0U)
        {
            tmpResult = Cy_Crypto_Core_JacobianEcAdd(base, my_s_x, my_s_y, my_s_z, my_t_x, my_t_y, size);

            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
        }
    }

    /* Inverse transform */
    tmpResult = Cy_Crypto_Core_JacobianInvTransform(base, my_s_x, my_s_y, my_s_z, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(my_s_z) |
                          CY_CRYPTO_VU_REG_BIT(my_t_x) | CY_CRYPTO_VU_REG_BIT(my_t_y) |
                          CY_CRYPTO_VU_REG_BIT(clr)    | CY_CRYPTO_VU_REG_BIT(t));

    CY_CRYPTO_VU_POP_REG(base);
    return CY_CRYPTO_SUCCESS;
}

/***************************************************************
*                   Test methods
***************************************************************/


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_NistP_SetMode
****************************************************************************//**
*
* Enable some curve specific features.
*
* \param bitsize
* bitsize of the used NIST P curve.
*
*******************************************************************************/
void Cy_Crypto_Core_EC_NistP_SetMode(uint32_t bitsize)
{
    switch (bitsize)
    {
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED)
    case CY_CRYPTO_ECC_P192_SIZE:
        eccMode = CY_CRYPTO_ECC_ECP_SECP192R1;
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED)
    case CY_CRYPTO_ECC_P224_SIZE:
        eccMode = CY_CRYPTO_ECC_ECP_SECP224R1;
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED)
    case CY_CRYPTO_ECC_P256_SIZE:
        eccMode = CY_CRYPTO_ECC_ECP_SECP256R1;
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED)
    case CY_CRYPTO_ECC_P384_SIZE:
        eccMode = CY_CRYPTO_ECC_ECP_SECP384R1;
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED)
    case CY_CRYPTO_ECC_P521_SIZE:
        eccMode = CY_CRYPTO_ECC_ECP_SECP521R1;
        break;
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED) */
    default:
        eccMode = CY_CRYPTO_ECC_ECP_NONE;
        break;
    }
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_NistP_SetRedAlg
****************************************************************************//**
*
* Select which reduction algorithm has to be used.
*
* \param alg
* one of {CURVE_SPECIFIC_RED_ALG, SHIFT_MUL_RED_ALG, BARRETT_RED_ALG}.
* See \ref cy_en_crypto_ecc_red_mul_algs_t.
*
*******************************************************************************/
void Cy_Crypto_Core_EC_NistP_SetRedAlg(cy_en_crypto_ecc_red_mul_algs_t alg)
{
    mul_red_alg_select = alg;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_NistP_PointMul
****************************************************************************//**
*
* Elliptic curve point multiplication in GF(p).
*
* \param base
* The pointer to a Crypto instance.
*
* \param p_x
* Register index for affine X coordinate of base point.
*
* \param p_y
* Register index for affine Y coordinate of base point.
*
* \param p_d
* Register index for multiplication value.
*
* \param p_order
* Register index for order value..
*
* \param bitsize
* Bit size of the used curve.
*
* \return status code. See \ref cy_en_crypto_status_t.
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_EC_NistP_PointMul(CRYPTO_Type *base, uint32_t p_x, uint32_t p_y, uint32_t p_d, uint32_t p_order, uint32_t bitsize)
{
    (void)p_order; /* Suppress warning */
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    tmpResult = Cy_Crypto_Core_JacobianEcScalarMul(base, p_x, p_y, p_d, bitsize);
    Cy_Crypto_Core_Vu_WaitForComplete(base);

