PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_ecc_nist_p.c
    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_EC_NistP_PointMultiplication
****************************************************************************//**
*
* Elliptic curve point multiplication in GF(p).
*
* When D-Cache is enabled parameter ecpGX, ecpGY, ecpD, ecpQX & ecpQY must align and end in 32 byte boundary.
*
* \param base
* The pointer to a Crypto instance.
*
* \param curveID
* See \ref cy_en_crypto_ecc_curve_id_t.
*
* \param ecpGX
* Register index for affine X coordinate of base point.
*
* \param ecpGY
* Register index for affine Y coordinate of base point.
*
* \param ecpD
* Register index for multiplication value.
*
* \param ecpQX
* Register index for affine X coordinate of result point.
*
* \param ecpQY
* Register index for affine Y coordinate of result point.
*
* \return status code. See \ref cy_en_crypto_status_t.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_EC_NistP_PointMultiplication(CRYPTO_Type *base,
        cy_en_crypto_ecc_curve_id_t curveID,
        const uint8_t *ecpGX,
        const uint8_t *ecpGY,
        const uint8_t *ecpD,
        uint8_t *ecpQX,
        uint8_t *ecpQY)
{
    /* N.b. If using test vectors from "http://point-at-infinity.org/ecc/nisttv",
     * the 'k' values on the website are in decimal form, while the (x,y) result
     * coordinates are in hexadecimal form
     * Input format for 'd' scalar multiplier in this test is in hexadecimal form.
     * Hence, convert k_{dec} to d_{hex} for comparison of test values
     */

    /* Setup additional registers */
    uint32_t VR_ORDER = 9u;

    const uint8_t *p_polynomial = NULL;
    const uint8_t *p_barrett = NULL;

    cy_stc_crypto_ecc_dp_type *eccDp = Cy_Crypto_Core_ECC_GetCurveParams(curveID);

    cy_en_crypto_status_t tmpResult = CY_CRYPTO_NOT_SUPPORTED;

    if (eccDp != NULL)
    {
        /* Setup curve specific parameters depending on mode */
        uint32_t bitsize;

        p_polynomial = (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->prime);
        p_barrett    = (uint8_t const *)CY_REMAP_ADDRESS_FOR_CRYPTO(eccDp->barrett_p);
        bitsize      = eccDp->size;

        /* use Barrett reduction algorithm for operations modulo n (order of the base point) */
        Cy_Crypto_Core_EC_NistP_SetRedAlg(eccDp->algo);
        Cy_Crypto_Core_EC_NistP_SetMode(eccDp->size);

        tmpResult = CY_CRYPTO_BAD_PARAMS;

        if ((NULL != ecpGX) && (NULL != ecpGY) && (NULL != ecpD) && (NULL != ecpQX) && (NULL != ecpQY))
        {
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            /* Flush the cache */
            SCB_CleanDCache_by_Addr((volatile void *)ecpGX, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
            SCB_CleanDCache_by_Addr((volatile void *)ecpGY, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
            SCB_CleanDCache_by_Addr((volatile void *)ecpD, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
#endif
            /* Public parameters and characteristics of elliptic curve */
            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_D, bitsize);         /* Scalar factor */
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_X, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_S_Y, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_P, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_BARRETT, bitsize + 1u);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, VR_ORDER, bitsize);
            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            Cy_Crypto_Core_Vu_SetMemValue(base, VR_P, p_polynomial, bitsize);

            /* Preparation (either use precalculated or calculated). */
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_BARRETT, p_barrett, bitsize + 1u);

            Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_X, ecpGX, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_S_Y, ecpGY, bitsize);
            Cy_Crypto_Core_Vu_SetMemValue(base, VR_D, ecpD, bitsize);

            /* ECC calculation: d * G mod p */
            tmpResult = Cy_Crypto_Core_EC_NistP_PointMul(base, VR_S_X, VR_S_Y, VR_D, VR_ORDER, bitsize);

            if (CY_CRYPTO_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            /* Get result P = (X,Y) = d.G from EC scalar multiplication */
            Cy_Crypto_Core_Vu_GetMemValue(base, ecpQX, VR_S_X, bitsize);
            Cy_Crypto_Core_Vu_GetMemValue(base, ecpQY, VR_S_Y, bitsize);
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
            SCB_InvalidateDCache_by_Addr(ecpQX, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
            SCB_InvalidateDCache_by_Addr(ecpQY, (int32_t)CY_CRYPTO_BYTE_SIZE_OF_BITS(bitsize));
#endif
            /* Free memory */
            CY_CRYPTO_VU_FREE_MEM(base,
                                  CY_CRYPTO_VU_REG_BIT(VR_ORDER) |
                                  CY_CRYPTO_VU_REG_BIT(VR_BARRETT) |
                                  CY_CRYPTO_VU_REG_BIT(VR_P) |
                                  CY_CRYPTO_VU_REG_BIT(VR_S_Y) |
                                  CY_CRYPTO_VU_REG_BIT(VR_S_X) |
                                  CY_CRYPTO_VU_REG_BIT(VR_D));

            tmpResult = CY_CRYPTO_SUCCESS;
        }
    }

    return tmpResult;
}

#endif /* defined (CY_CRYPTO_CFG_ECP_C) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTO */


/* [] END OF FILE */
